---
type: StructuralSectionHotRolled
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 5
tags: [revit-api, class]
---

# StructuralSectionHotRolled

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FlangeThickness | 2015 | `public double FlangeThickness { get ; set ; }` |
| Property | FlangeThicknessLocation | 2015 | `public double FlangeThicknessLocation { get ; set ; }` |
| Property | WebFillet | 2015 | `public double WebFillet { get ; set ; }` |
| Property | WebThickness | 2015 | `public double WebThickness { get ; set ; }` |
| Property | WebThicknessLocation | 2015 | `public double WebThicknessLocation { get ; set ; }` |